Revit 2024 API
FabricationUtils.ExportToPCF Method
 Exports a list of fabrication parts into PCF format.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public static void ExportToPCF(
	Document document,
	IList<ElementId> ids,
	string filename
)
Visual Basic
Public Shared Sub ExportToPCF ( _
	document As Document, _
	ids As IList(Of ElementId), _
	filename As String _
)
Visual C++
public:
static void ExportToPCF(
	Document^ document,
	IList<ElementId^>^ ids,
	String^ filename
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document.
ids
Type: System.Collections.Generic.IList<ElementId>
 An array of FabricationPart element identifiers. Non-fabrication parts are ignored.
filename
Type: System.String
 The name given to the output file.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  Fabrication configuration is missing.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
FabricationUtils Class
Autodesk.Revit.DB.Fabrication Namespace